IdeaRS.OpenModel.Connection.IAppController
Enables controlling of the application IdeaConnection

IdeaRS.OpenModel.Connection.IAppController.OpenIdeaConnection(System.Byte[],System.Byte[],System.Byte[],System.Byte[],System.Byte[])
Opens the application Idea Connection and waits till this application is closed
iom: The input stream which includes IdeaOpenModel (in xml format)
results: The input stream which includes OpenModelResult (in xml format)
existingConProj: The input stream which includes Idea Connection project (binary data)
requiredTemplate: The input stream which includes Idea Connection remplate (CONTEMP file)
importSettings: Connection import settings

IdeaRS.OpenModel.Connection.IAppController.OpenIdeaConnectionService


IdeaRS.OpenModel.Connection.IAppController.GetConnectionData(System.Guid)
connectionId:
Returns:

IdeaRS.OpenModel.Connection.IAppController.GetIdeaConnectionProject
Returns: